config/Catalogs/ИА_ЦО_АлгоритмыРознЦеныПоЦенамКонкурентов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Catalog>
		<Properties>
			<Name>ИА_ЦО_АлгоритмыРознЦеныПоЦенамКонкурентов</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Актуальность</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Кейс</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ИА_ЦО_ТипыКейсовАлгоритмВыравниванияРЦпоЦК</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипУсловияПризнака</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Признак</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыСпроса</v8:Type>
						<v8:Type>cfg:CatalogRef.Производители</v8:Type>
						<v8:Type>cfg:CatalogRef.Брэнды</v8:Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:Type>cfg:CatalogRef.ГруппировкиАссортимента</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Признак2</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Алгоритм</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ИА_ЦО_АлгоритмыВыравниванияРЦпоЦК</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачалаДействия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончанияДействия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипУсловияКонкурент</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Конкурент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИА_ЦО_Конкуренты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПризнакСписком</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ПризнакЗначение</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВидыСпроса</v8:Type>
								<v8:Type>cfg:CatalogRef.Производители</v8:Type>
								<v8:Type>cfg:CatalogRef.Брэнды</v8:Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:Type>cfg:CatalogRef.ГруппировкиАссортимента</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Список</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Код1С</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>12</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТоварФирмы</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.АССОРТИМЕНТНЫЙ_ПЛАН</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>КонкурентСписком</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>КонкурентЗначение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ИА_ЦО_Конкуренты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

config/InformationRegisters/ИА_ЦО_АлгоритмыРознЦеныПоЦенамКонкурентов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>ИА_ЦО_АлгоритмыРознЦеныПоЦенамКонкурентов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Алгоритм</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ИА_ЦО_АлгоритмыВыравниванияРЦпоЦК</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Приоритет</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ДатаНачалаДействия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончанияДействия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Код1С</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СсылкаСправочник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИА_ЦО_АлгоритмыРознЦеныПоЦенамКонкурентов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

config/Enums/ИА_ЦО_ТипыКейсовАлгоритмВыравниванияРЦпоЦК.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Enum>
		<Properties>
			<Name>ИА_ЦО_ТипыКейсовАлгоритмВыравниванияРЦпоЦК</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Спрос</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЦеноваяГруппа</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КатегорияТовара</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Бренд</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Производитель</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВесьАссортимент</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Список</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

config/Catalogs/ИА_ЦО_АлгоритмыРознЦеныПоЦенамКонкурентов/Ext/ObjectModule.bsl
Процедура СформироватьЗаписиРС() Экспорт

	Запрос = Новый Запрос;
	
	НЗ = РегистрыСведений.ИА_ЦО_АлгоритмыРознЦеныПоЦенамКонкурентов.СоздатьНаборЗаписей();
	НЗ.Отбор.СсылкаСправочник.Установить(Ссылка);
	НЗ.Отбор.СсылкаСправочник.ВидСравнения = ВидСравнения.Равно;
	НЗ.Отбор.СсылкаСправочник.Использование = Истина;
	НЗ.Прочитать();
	НЗ.Очистить();
	
	Если Кейс = Перечисления.ИА_ЦО_ТипыКейсовАлгоритмВыравниванияРЦпоЦК.ВесьАссортимент Тогда
	
		ТекстЗапроса = 
		"ВЫБРАТЬ
		|	АССОРТИМЕНТНЫЙ_ПЛАН.Код КАК Код
		|ИЗ
		|	Справочник.АССОРТИМЕНТНЫЙ_ПЛАН КАК АССОРТИМЕНТНЫЙ_ПЛАН
		|ГДЕ
		|	АССОРТИМЕНТНЫЙ_ПЛАН.ЭтоГруппа = ЛОЖЬ";
		Запрос.Текст = ТекстЗапроса;
		ВыборкаАП = Запрос.Выполнить().Выбрать();
		Пока ВыборкаАП.Следующий() Цикл
		
			СтрокаНЗ = НЗ.Добавить();
			СтрокаНЗ.Код1С					= ВыборкаАП.Код;
			СтрокаНЗ.СсылкаСправочник		= Ссылка;
			СтрокаНЗ.Алгоритм				= Алгоритм;
			СтрокаНЗ.Приоритет				= 7;
			СтрокаНЗ.ДатаНачалаДействия		= ДатаНачалаДействия;
			СтрокаНЗ.ДатаОкончанияДействия	= ДатаОкончанияДействия;
		
		КонецЦикла;
	
	ИначеЕсли Кейс = Перечисления.ИА_ЦО_ТипыКейсовАлгоритмВыравниванияРЦпоЦК.ЦеноваяГруппа Тогда
	 	// Ценовые группы не записываем, т.к. мы не знаем к какому конкретно товару 1С относится данный элемент справочника
	ИначеЕсли Кейс = Перечисления.ИА_ЦО_ТипыКейсовАлгоритмВыравниванияРЦпоЦК.Спрос
		ИЛИ Кейс = Перечисления.ИА_ЦО_ТипыКейсовАлгоритмВыравниванияРЦпоЦК.КатегорияТовара 
		ИЛИ Кейс = Перечисления.ИА_ЦО_ТипыКейсовАлгоритмВыравниванияРЦпоЦК.Бренд 
		ИЛИ Кейс = Перечисления.ИА_ЦО_ТипыКейсовАлгоритмВыравниванияРЦпоЦК.Производитель Тогда
		
		Если Кейс = Перечисления.ИА_ЦО_ТипыКейсовАлгоритмВыравниванияРЦпоЦК.Спрос Тогда
			НомерПриоритета = 5;
			ИмяРеквизита = "Спрос";
		ИначеЕсли Кейс = Перечисления.ИА_ЦО_ТипыКейсовАлгоритмВыравниванияРЦпоЦК.КатегорияТовара Тогда
		    НомерПриоритета = 4;
			ИмяРеквизита = "НоваяКатегория";
		ИначеЕсли Кейс = Перечисления.ИА_ЦО_ТипыКейсовАлгоритмВыравниванияРЦпоЦК.Бренд Тогда
		    НомерПриоритета = 3;
			ИмяРеквизита = "Бренд";
		ИначеЕсли Кейс = Перечисления.ИА_ЦО_ТипыКейсовАлгоритмВыравниванияРЦпоЦК.Производитель Тогда
		    НомерПриоритета = 2;
			ИмяРеквизита = "Производитель";
		КонецЕсли; 
		
		Если ТипУсловияПризнака = "=" Тогда
		
			ТекстЗапроса = 
			"ВЫБРАТЬ
			|	АССОРТИМЕНТНЫЙ_ПЛАН.Код КАК Код
			|ИЗ
			|	Справочник.АССОРТИМЕНТНЫЙ_ПЛАН КАК АССОРТИМЕНТНЫЙ_ПЛАН
			|ГДЕ
			|	АССОРТИМЕНТНЫЙ_ПЛАН.ЭтоГруппа = ЛОЖЬ
			|	И АССОРТИМЕНТНЫЙ_ПЛАН."+ИмяРеквизита+" = &Параметр";
			Запрос.Текст = ТекстЗапроса;
			Запрос.УстановитьПараметр("Параметр", Признак);
			ВыборкаАП = Запрос.Выполнить().Выбрать();
		
		ИначеЕсли ТипУсловияПризнака = "<>" Тогда
			
			ТекстЗапроса = 
			"ВЫБРАТЬ
			|	АССОРТИМЕНТНЫЙ_ПЛАН.Код КАК Код
			|ИЗ
			|	Справочник.АССОРТИМЕНТНЫЙ_ПЛАН КАК АССОРТИМЕНТНЫЙ_ПЛАН
			|ГДЕ
			|	АССОРТИМЕНТНЫЙ_ПЛАН.ЭтоГруппа = ЛОЖЬ
			|	И АССОРТИМЕНТНЫЙ_ПЛАН."+ИмяРеквизита+" <> &Параметр";
			Запрос.Текст = ТекстЗапроса;
			Запрос.УстановитьПараметр("Параметр", Признак);
			ВыборкаАП = Запрос.Выполнить().Выбрать();
			
		ИначеЕсли ТипУсловияПризнака = "В списке" Тогда
			
			ТекстЗапроса = 
			"ВЫБРАТЬ
			|	АССОРТИМЕНТНЫЙ_ПЛАН.Код КАК Код
			|ИЗ
			|	Справочник.АССОРТИМЕНТНЫЙ_ПЛАН КАК АССОРТИМЕНТНЫЙ_ПЛАН
			|ГДЕ
			|	АССОРТИМЕНТНЫЙ_ПЛАН.ЭтоГруппа = ЛОЖЬ
			|	И АССОРТИМЕНТНЫЙ_ПЛАН."+ИмяРеквизита+" в (&Параметр)";
		
			Запрос.Текст = ТекстЗапроса;
			Запрос.УстановитьПараметр("Параметр", ПризнакСписком.ВыгрузитьКолонку("ПризнакЗначение"));
			ВыборкаАП = Запрос.Выполнить().Выбрать();
			
		ИначеЕсли ТипУсловияПризнака = "Не в списке" Тогда
			
			ТекстЗапроса = 
			"ВЫБРАТЬ
			|	АССОРТИМЕНТНЫЙ_ПЛАН.Код КАК Код
			|ИЗ
			|	Справочник.АССОРТИМЕНТНЫЙ_ПЛАН КАК АССОРТИМЕНТНЫЙ_ПЛАН
			|ГДЕ
			|	АССОРТИМЕНТНЫЙ_ПЛАН.ЭтоГруппа = ЛОЖЬ
			|	И НЕ АССОРТИМЕНТНЫЙ_ПЛАН."+ИмяРеквизита+" в (&Параметр)";
			Запрос.Текст = ТекстЗапроса;
			Запрос.УстановитьПараметр("Параметр", ПризнакСписком.ВыгрузитьКолонку("ПризнакЗначение"));
			ВыборкаАП = Запрос.Выполнить().Выбрать();
		
		КонецЕсли;
		
		Пока ВыборкаАП.Следующий() Цикл
			
			СтрокаНЗ = НЗ.Добавить();
			СтрокаНЗ.Код1С					= ВыборкаАП.Код;
			СтрокаНЗ.СсылкаСправочник		= Ссылка;
			СтрокаНЗ.Алгоритм				= Алгоритм;
			СтрокаНЗ.Приоритет				= НомерПриоритета;
			СтрокаНЗ.ДатаНачалаДействия		= ДатаНачалаДействия;
			СтрокаНЗ.ДатаОкончанияДействия	= ДатаОкончанияДействия;
			
		КонецЦикла;
		
	ИначеЕсли Кейс = Перечисления.ИА_ЦО_ТипыКейсовАлгоритмВыравниванияРЦпоЦК.Список Тогда
		
		 НомерПриоритета = 1;
		Если ТипУсловияПризнака = "В списке" Тогда
			
			ТекстЗапроса = 
			"ВЫБРАТЬ
			|	АССОРТИМЕНТНЫЙ_ПЛАН.Код КАК Код
			|ИЗ
			|	Справочник.АССОРТИМЕНТНЫЙ_ПЛАН КАК АССОРТИМЕНТНЫЙ_ПЛАН
			|ГДЕ
			|	АССОРТИМЕНТНЫЙ_ПЛАН.ЭтоГруппа = ЛОЖЬ
			|	И АССОРТИМЕНТНЫЙ_ПЛАН.Код В(&Параметр)";
		
			Запрос.Текст = ТекстЗапроса;
			Запрос.УстановитьПараметр("Параметр", Список.ВыгрузитьКолонку("Код1С"));
			ВыборкаАП = Запрос.Выполнить().Выбрать();
			
		ИначеЕсли ТипУсловияПризнака = "Не в списке" Тогда
			
			ТекстЗапроса = 
			"ВЫБРАТЬ
			|	АССОРТИМЕНТНЫЙ_ПЛАН.Код КАК Код
			|ИЗ
			|	Справочник.АССОРТИМЕНТНЫЙ_ПЛАН КАК АССОРТИМЕНТНЫЙ_ПЛАН
			|ГДЕ
			|	АССОРТИМЕНТНЫЙ_ПЛАН.ЭтоГруппа = ЛОЖЬ
			|	И НЕ АССОРТИМЕНТНЫЙ_ПЛАН.Код В (&Параметр)";
			Запрос.Текст = ТекстЗапроса;
			Запрос.УстановитьПараметр("Параметр", Список.ВыгрузитьКолонку("Код1С"));
			ВыборкаАП = Запрос.Выполнить().Выбрать();
			
		КонецЕсли;
		
		Пока ВыборкаАП.Следующий() Цикл
			
			СтрокаНЗ = НЗ.Добавить();
			СтрокаНЗ.Код1С					= ВыборкаАП.Код;
			СтрокаНЗ.СсылкаСправочник		= Ссылка;
			СтрокаНЗ.Алгоритм				= Алгоритм;
			СтрокаНЗ.Приоритет				= НомерПриоритета;
			СтрокаНЗ.ДатаНачалаДействия		= ДатаНачалаДействия;
			СтрокаНЗ.ДатаОкончанияДействия	= ДатаОкончанияДействия;
			
		КонецЦикла;
		
	КонецЕсли; 	

	НЗ.Записать();
	
КонецПроцедуры

Процедура УдалитьЗаписиРС() Экспорт

	НЗ = РегистрыСведений.ИА_ЦО_АлгоритмыРознЦеныПоЦенамКонкурентов.СоздатьНаборЗаписей();
	НЗ.Отбор.СсылкаСправочник.Установить(Ссылка);
	НЗ.Отбор.СсылкаСправочник.ВидСравнения = ВидСравнения.Равно;
	НЗ.Отбор.СсылкаСправочник.Использование = Истина;
	НЗ.Прочитать();
	НЗ.Очистить();
	НЗ.Записать();
	
КонецПроцедуры
